Ran Plan for dir: `eks` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.test-k8s-cluster.module.eks_cluster.data.template_file.configmap_auth[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "configmap_auth"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            apiVersion: v1
            kind: ConfigMap
            metadata:
              name: aws-auth
              namespace: kube-system
            data:
              mapRoles: |
                ${indent(4, map_worker_roles_yaml)}
            %{if map_additional_iam_roles_yaml != "[]" }
                ${indent(4, map_additional_iam_roles_yaml)}
            %{ endif }
            %{if map_additional_iam_users_yaml != "[]" }
              mapUsers: |
                ${indent(4, map_additional_iam_users_yaml)}
            %{ endif }
            %{if map_additional_aws_accounts_yaml != "[]" }
              mapAccounts: |
                ${indent(4, map_additional_aws_accounts_yaml)}
            %{ endif }
        EOT
      + vars     = {
          + "map_additional_aws_accounts_yaml" = jsonencode([])
          + "map_additional_iam_roles_yaml"    = jsonencode([])
          + "map_additional_iam_users_yaml"    = jsonencode([])
          + "map_worker_roles_yaml"            = (known after apply)
        }
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_eks_cluster.default[0] will be created
+ resource "aws_eks_cluster" "default" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "bemit-testing-test-k8s-cluster-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Attributes" = "cluster"
          + "Name"       = "bemit-testing-test-k8s-cluster-cluster"
          + "Namespace"  = "bemit"
          + "Stage"      = "testing"
        }
      + version               = (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-0c9af00dded027aa0",
            ]
          + subnet_ids                = [
              + "subnet-040f7cf02fe6e166b",
              + "subnet-0f7832ca0438cc277",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role.default[0] will be created
+ resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bemit-testing-test-k8s-cluster-cluster"
      + path                  = "/"
      + tags                  = {
          + "Attributes" = "cluster"
          + "Name"       = "bemit-testing-test-k8s-cluster-cluster"
          + "Namespace"  = "bemit"
          + "Stage"      = "testing"
        }
      + unique_id             = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_cluster_policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "bemit-testing-test-k8s-cluster-cluster"
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_service_policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_eks_service_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "bemit-testing-test-k8s-cluster-cluster"
    }

  # module.test-k8s-cluster.module.eks_cluster.local_file.configmap_auth[0] will be created
+ resource "local_file" "configmap_auth" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "~/.terraform/configmap-auth.yaml"
      + id                   = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_cluster.null_resource.apply_configmap_auth[0] will be created
+ resource "null_resource" "apply_configmap_auth" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.data.template_file.userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            #!/bin/bash
            
            # userdata for EKS worker nodes to properly configure Kubernetes applications on EC2 instances
            # https://docs.aws.amazon.com/eks/latest/userguide/launch-workers.html
            # https://aws.amazon.com/blogs/opensource/improvements-eks-worker-node-provisioning/
            # https://github.com/awslabs/amazon-eks-ami/blob/master/files/bootstrap.sh#L97
            
            ${before_cluster_joining_userdata}
            
            export KUBELET_EXTRA_ARGS=${bootstrap_extra_args}
            
            /etc/eks/bootstrap.sh --apiserver-endpoint '${cluster_endpoint}' --b64-cluster-ca '${certificate_authority_data}' '${cluster_name}'
            
            ${after_cluster_joining_userdata}
        EOT
      + vars     = {
          + "after_cluster_joining_userdata"  = ""
          + "before_cluster_joining_userdata" = ""
          + "bootstrap_extra_args"            = ""
          + "certificate_authority_data"      = (known after apply)
          + "cluster_endpoint"                = (known after apply)
          + "cluster_name"                    = "bemit-testing-test-k8s-cluster-cluster"
        }
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_instance_profile.default[0] will be created
+ resource "aws_iam_instance_profile" "default" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "bemit-testing-test-k8s-cluster-workers"
      + path        = "/"
      + role        = "bemit-testing-test-k8s-cluster-workers"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role.default[0] will be created
+ resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bemit-testing-test-k8s-cluster-workers"
      + path                  = "/"
      + tags                  = {
          + "Attributes"                                                   = "workers"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
        }
      + unique_id             = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_ec2_container_registry_read_only[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_ec2_container_registry_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "bemit-testing-test-k8s-cluster-workers"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_eks_cni_policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "bemit-testing-test-k8s-cluster-workers"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_eks_worker_node_policy[0] will be created
+ resource "aws_iam_role_policy_attachment" "amazon_eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "bemit-testing-test-k8s-cluster-workers"
    }

  # module.test-k8s-cluster.module.eks_workers.module.autoscale_group.aws_autoscaling_group.default[0] will be created
+ resource "aws_autoscaling_group" "default" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 300
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_elb_capacity          = 0
      + min_size                  = 2
      + name                      = (known after apply)
      + name_prefix               = "bemit-testing-test-k8s-cluster-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Attributes"
              + "propagate_at_launch" = "true"
              + "value"               = "workers"
            },
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "bemit-testing-test-k8s-cluster-workers"
            },
          + {
              + "key"                 = "Namespace"
              + "propagate_at_launch" = "true"
              + "value"               = "bemit"
            },
          + {
              + "key"                 = "Stage"
              + "propagate_at_launch" = "true"
              + "value"               = "testing"
            },
          + {
              + "key"                 = "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster"
              + "propagate_at_launch" = "true"
              + "value"               = "owned"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = [
          + "Default",
        ]
      + vpc_zone_identifier       = [
          + "subnet-040f7cf02fe6e166b",
          + "subnet-0f7832ca0438cc277",
        ]
      + wait_for_capacity_timeout = "10m"
      + wait_for_elb_capacity     = 0

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # module.test-k8s-cluster.module.eks_workers.module.autoscale_group.aws_launch_template.default[0] will be created
+ resource "aws_launch_template" "default" {
      + arn                                  = (known after apply)
      + default_version                      = (known after apply)
      + disable_api_termination              = false
      + ebs_optimized                        = "false"
      + id                                   = (known after apply)
      + image_id                             = "ami-0eb6419458800872a"
      + instance_initiated_shutdown_behavior = "terminate"
      + instance_type                        = "t3a.small"
      + latest_version                       = (known after apply)
      + name                                 = (known after apply)
      + name_prefix                          = "bemit-testing-test-k8s-cluster-"
      + tags                                 = {
          + "Attributes"                                                   = "workers"
          + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
          + "Namespace"                                                    = "bemit"
          + "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
        }
      + user_data                            = (known after apply)

      + iam_instance_profile {
          + name = "bemit-testing-test-k8s-cluster-workers"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = true
          + description                 = "bemit-testing-test-k8s-cluster"
          + device_index                = 0
          + security_groups             = [
              + "sg-014dc3bbfb45c56a2",
            ]
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Attributes"                                                   = "workers"
              + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
              + "Namespace"                                                    = "bemit"
              + "Stage"                                                        = "testing"
              + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Attributes"                                                   = "workers"
              + "Name"                                                         = "bemit-testing-test-k8s-cluster-workers"
              + "Namespace"                                                    = "bemit"
              + "Stage"                                                        = "testing"
              + "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned"
            }
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d eks`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.247.12.82/lock?id=bmtoml%252Fatlaaaaaaantis%252Feks%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d eks`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
